; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport city-sequential-5nodes-1000size-5degree-100mindistance-2trucks-6packages-1128seed

(define (problem transport-city-sequential-5nodes-1000size-5degree-100mindistance-2trucks-6packages-1128seed)
 (:domain transport)
 (:objects
  city-loc-1 - location
  city-loc-2 - location
  city-loc-3 - location
  city-loc-4 - location
  city-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  package-3 - package
  package-4 - package
  package-5 - package
  package-6 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 131,437 -> 76,531
  (road city-loc-2 city-loc-1)
  (= (road-length city-loc-2 city-loc-1) 11)
  ; 76,531 -> 131,437
  (road city-loc-1 city-loc-2)
  (= (road-length city-loc-1 city-loc-2) 11)
  ; 118,875 -> 76,531
  (road city-loc-3 city-loc-1)
  (= (road-length city-loc-3 city-loc-1) 35)
  ; 76,531 -> 118,875
  (road city-loc-1 city-loc-3)
  (= (road-length city-loc-1 city-loc-3) 35)
  ; 118,875 -> 131,437
  (road city-loc-3 city-loc-2)
  (= (road-length city-loc-3 city-loc-2) 44)
  ; 131,437 -> 118,875
  (road city-loc-2 city-loc-3)
  (= (road-length city-loc-2 city-loc-3) 44)
  ; 596,447 -> 76,531
  (road city-loc-4 city-loc-1)
  (= (road-length city-loc-4 city-loc-1) 53)
  ; 76,531 -> 596,447
  (road city-loc-1 city-loc-4)
  (= (road-length city-loc-1 city-loc-4) 53)
  ; 596,447 -> 131,437
  (road city-loc-4 city-loc-2)
  (= (road-length city-loc-4 city-loc-2) 47)
  ; 131,437 -> 596,447
  (road city-loc-2 city-loc-4)
  (= (road-length city-loc-2 city-loc-4) 47)
  ; 596,447 -> 118,875
  (road city-loc-4 city-loc-3)
  (= (road-length city-loc-4 city-loc-3) 65)
  ; 118,875 -> 596,447
  (road city-loc-3 city-loc-4)
  (= (road-length city-loc-3 city-loc-4) 65)
  ; 119,319 -> 76,531
  (road city-loc-5 city-loc-1)
  (= (road-length city-loc-5 city-loc-1) 22)
  ; 76,531 -> 119,319
  (road city-loc-1 city-loc-5)
  (= (road-length city-loc-1 city-loc-5) 22)
  ; 119,319 -> 131,437
  (road city-loc-5 city-loc-2)
  (= (road-length city-loc-5 city-loc-2) 12)
  ; 131,437 -> 119,319
  (road city-loc-2 city-loc-5)
  (= (road-length city-loc-2 city-loc-5) 12)
  ; 119,319 -> 118,875
  (road city-loc-5 city-loc-3)
  (= (road-length city-loc-5 city-loc-3) 56)
  ; 118,875 -> 119,319
  (road city-loc-3 city-loc-5)
  (= (road-length city-loc-3 city-loc-5) 56)
  ; 119,319 -> 596,447
  (road city-loc-5 city-loc-4)
  (= (road-length city-loc-5 city-loc-4) 50)
  ; 596,447 -> 119,319
  (road city-loc-4 city-loc-5)
  (= (road-length city-loc-4 city-loc-5) 50)
  (at package-1 city-loc-4)
  (at package-2 city-loc-3)
  (at package-3 city-loc-5)
  (at package-4 city-loc-5)
  (at package-5 city-loc-3)
  (at package-6 city-loc-4)
  (at truck-1 city-loc-3)
  (capacity truck-1 capacity-2)
  (at truck-2 city-loc-1)
  (capacity truck-2 capacity-4)
 )
 (:goal (and
  (at package-1 city-loc-3)
  (at package-2 city-loc-4)
  (at package-3 city-loc-1)
  (at package-4 city-loc-4)
  (at package-5 city-loc-1)
  (at package-6 city-loc-5)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (pick-up truck-1 city-loc-3 package-2 capacity-1 capacity-2)
   deleted: (at package-2 city-loc-3) (capacity truck-1 capacity-2)
   added: (in package-2 truck-1) (capacity truck-1 capacity-1)
   goals met: 0 of 6
2. (drive truck-1 city-loc-3 city-loc-5)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-5)
   goals met: 0 of 6
3. (pick-up truck-1 city-loc-5 package-4 capacity-0 capacity-1)
   deleted: (at package-4 city-loc-5) (capacity truck-1 capacity-1)
   added: (in package-4 truck-1) (capacity truck-1 capacity-0)
   goals met: 0 of 6
4. (drive truck-1 city-loc-5 city-loc-4)
   deleted: (at truck-1 city-loc-5)
   added: (at truck-1 city-loc-4)
   goals met: 0 of 6
5. (drop truck-1 city-loc-4 package-4 capacity-0 capacity-1)
   deleted: (in package-4 truck-1) (capacity truck-1 capacity-0)
   added: (at package-4 city-loc-4) (capacity truck-1 capacity-1)
   goals met: 1 of 6
6. (pick-up truck-1 city-loc-4 package-6 capacity-0 capacity-1)
   deleted: (at package-6 city-loc-4) (capacity truck-1 capacity-1)
   added: (in package-6 truck-1) (capacity truck-1 capacity-0)
   goals met: 1 of 6
7. (drop truck-1 city-loc-4 package-2 capacity-0 capacity-1)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-0)
   added: (at package-2 city-loc-4) (capacity truck-1 capacity-1)
   goals met: 2 of 6
8. (pick-up truck-1 city-loc-4 package-1 capacity-0 capacity-1)
   deleted: (at package-1 city-loc-4) (capacity truck-1 capacity-1)
   added: (in package-1 truck-1) (capacity truck-1 capacity-0)
   goals met: 2 of 6
9. (drive truck-1 city-loc-4 city-loc-3)
   deleted: (at truck-1 city-loc-4)
   added: (at truck-1 city-loc-3)
   goals met: 2 of 6
10. (drop truck-1 city-loc-3 package-1 capacity-0 capacity-1)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-0)
   added: (at package-1 city-loc-3) (capacity truck-1 capacity-1)
   goals met: 3 of 6
11. (pick-up truck-1 city-loc-3 package-5 capacity-0 capacity-1)
   deleted: (at package-5 city-loc-3) (capacity truck-1 capacity-1)
   added: (in package-5 truck-1) (capacity truck-1 capacity-0)
   goals met: 3 of 6
12. (drive truck-1 city-loc-3 city-loc-5)
   deleted: (at truck-1 city-loc-3)
   added: (at truck-1 city-loc-5)
   goals met: 3 of 6
13. (drop truck-1 city-loc-5 package-6 capacity-0 capacity-1)
   deleted: (in package-6 truck-1) (capacity truck-1 capacity-0)
   added: (at package-6 city-loc-5) (capacity truck-1 capacity-1)
   goals met: 4 of 6
14. (pick-up truck-1 city-loc-5 package-3 capacity-0 capacity-1)
   deleted: (at package-3 city-loc-5) (capacity truck-1 capacity-1)
   added: (in package-3 truck-1) (capacity truck-1 capacity-0)
   goals met: 4 of 6
15. (drive truck-1 city-loc-5 city-loc-1)
   deleted: (at truck-1 city-loc-5)
   added: (at truck-1 city-loc-1)
   goals met: 4 of 6
16. (drop truck-1 city-loc-1 package-3 capacity-0 capacity-1)
   deleted: (in package-3 truck-1) (capacity truck-1 capacity-0)
   added: (at package-3 city-loc-1) (capacity truck-1 capacity-1)
   goals met: 5 of 6
17. (drop truck-1 city-loc-1 package-5 capacity-1 capacity-2)
   deleted: (in package-5 truck-1) (capacity truck-1 capacity-1)
   added: (at package-5 city-loc-1) (capacity truck-1 capacity-2)
   goals met: 6 of 6
